/* 
================================
- MP-DoS | Source
================================
- Автор: Плюха (Дмитрий Некраш) - https://www.youtube.com/@pluhaoff
- Файл: ./drivers/acpi_reboot.c
- Значение файла: Перезагрузка компьютера
- Создан в: Kali Linux
================================
*/

#include "./acpi_reboot.h"
#include "./lowlevel_io.h"
#include "../common.h"

void asm_reboot(){
	asm volatile (
		"cli;"                 // Отключаем прерывания
		"mov $0x0600, %ax;"    // Загружаем значение 0x0600 в регистр AX
		"mov $0x0001, %bx;"    // Загружаем значение 0x0001 в регистр BX
		"int $0x15;"           // Вызываем прерывание 0x15 с указанными параметрами
		"hlt;"                 // Завершаем выполнение процессора
	);
}
